stbenn/nuttx/arch/arm/src/stm32h5/stm32h52x_3x_rcc.c
      regval &= ~RCC_CFGR2_PPRE3_MASK;
      regval |= STM32H5_RCC_CFGR2_PPRE3;

      putreg32(regval, STM32H5_RCC_CFGR2);


#ifdef CONFIG_STM32H5_RTC_HSECLOCK
      /* Set the RTC clock divisor */

      regval  = getreg32(STM32H5_RCC_CFGR1);
      regval &= ~RCC_CFGR1_RTCPRE_MASK;
      regval |= RCC_CFGR1_RTCPRE(HSE_DIVISOR);
      putreg32(regval, STM32H5_RCC_CFGR1);
#endif

      /* Configure PLL1 */

      /* PLL1CFGR */

      regval  = getreg32(STM32H5_RCC_PLL1CFGR);
      
      /* Set the PLL1 source and main divider */

/* Can keep below ifdefs and add ifdefs on top for board.h definitions */

#ifdef STM32H5_PLL1SRC_HSI
      regval |= RCC_PLL1CFGR_PLL1SRC_HSI;
#elif defined(STM32H5_PLL1SRC_CSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_CSI;
#elif defined(STM32H5_PLL1SRC_HSE)
      regval |= RCC_PLL1CFGR_PLL1SRC_HSE;
#elif defined(STM32H5_BOARD_USEHSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_HSI;
#elif defined(STM32H5_BOARD_USECSI)
      regval |= RCC_PLL1CFGR_PLL1SRC_CSI;
#else /* if STM32H5_BOARD_USEHSE */
      regval |= RCC_PLL1CFGR_PLL1SRC_HSE;
#endif
     
      /* Set RGE, FRACEN, VCOSEL, and M from board.h */

      regval |= (STM32H5_PLL1CFGR_PLL1RGE | STM32H5_PLL1CFGR_PLL1FRACEN | 
		 STM32H5_PLL1CFGR_PLL1VCOSEL | STM32H5_PLL1CFGR_PLL1M);

#ifdef STM32H5_PLL1CFG_PLL1P_ENABLED
      regval |= RCC_PLL1CFGR_PLL1PEN;
#endif
#ifdef STM32H5_PLL1CFG_PLL1Q_ENABLED
      regval |= RCC_PLL1CFGR_PLL1QEN;
#endif
#ifdef STM32H5_PLL1CFG_PLL1R_ENABLED
      regval |= RCC_PLL1CFGR_PLL1REN;
#endif
      
      putreg32(regval, STM32H5_RCC_PLL1CFGR);

      /* PLL1DIVR and PLL1FRACR */
      
      /* Get settings from board.h */
     
      /* PLL1DIVR */

      regval  = getreg32(STM32H5_RCC_PLL1DIVR);
      regval = (STM32H5_PLL1DIVR_PLL1N | STM32H5_PLL1DIVR_PLL1P | 
		STM32H5_PLL1DIVR_PLL1Q | STM32H5_PLL1DIVR_PLL1R);
      putreg32(regval, STM32H5_RCC_PLL1DIVR);
      
      /* PLL1FRACR */

      regval  = getreg32(STM32H5_RCC_PLL1FRACR);
      regval |= STM32H5_PLL1FRACR_PLL1FRACN;
      putreg32(regval, STM32H5_RCC_PLL1FRACR);

      /* Enable PLL1 */

      regval  = getreg32(STM32H5_RCC_CR);
      regval |= RCC_CR_PLL1ON;
      putreg32(regval, STM32H5_RCC_CR);

      /* Wait until PLL1 is ready */

      while ((getreg32(STM32H5_RCC_CR) & RCC_CR_PLL1RDY) == 0)
        {
        }

      /* Configure PLL2 */

      /* PLL2CFGR */

      regval  = getreg32(STM32H5_RCC_PLL2CFGR);
      
      /* Set the PLL2 source and main divider */

#ifdef STM32H5_PLL2SRC_HSI
      regval |= RCC_PLL2CFGR_PLL2SRC_HSI;
#elif defined(STM32H5_PLL2SRC_CSI)
      regval |= RCC_PLL2CFGR_PLL2SRC_CSI;
#elif defined(STM32H5_PLL2SRC_HSE)
      regval |= RCC_PLL2CFGR_PLL2SRC_HSE;
#elif defined(STM32H5_BOARD_USEHSI)
      regval |= RCC_PLL2CFGR_PLL2SRC_HSI;
#elif defined(STM32H5_BOARD_USECSI)
      regval |= RCC_PLL2CFGR_PLL2SRC_CSI;
#else /* if STM32H5_BOARD_USEHSE */
      regval |= RCC_PLL2CFGR_PLL2SRC_HSE;
#endif
     
      /* Set RGE, FRACEN, VCOSEL, and M from board.h */

      regval |= (STM32H5_PLL2CFGR_PLL2RGE | STM32H5_PLL2CFGR_PLL2FRACEN | 
		 STM32H5_PLL2CFGR_PLL2VCOSEL | STM32H5_PLL2CFGR_PLL2M);

#ifdef STM32H5_PLL2CFG_PLL2P_ENABLED
      regval |= RCC_PLL2CFGR_PLL2PEN;
#endif
#ifdef STM32H5_PLL2CFG_PLL2Q_ENABLED
      regval |= RCC_PLL2CFGR_PLL2QEN;
#endif
#ifdef STM32H5_PLL2CFG_PLL2R_ENABLED
      regval |= RCC_PLL2CFGR_PLL2REN;
#endif
      
      putreg32(regval, STM32H5_RCC_PLL2CFGR);

      /* PLL2DIVR and PLL2FRACR */
      
      /* Get settings from board.h */
     
      /* PLL2DIVR */

      regval  = getreg32(STM32H5_RCC_PLL2DIVR);
      regval = (STM32H5_PLL2DIVR_PLL2N | STM32H5_PLL2DIVR_PLL2P | 
		STM32H5_PLL2DIVR_PLL2Q | STM32H5_PLL2DIVR_PLL2R);
      putreg32(regval, STM32H5_RCC_PLL2DIVR);
      
      /* PLL2FRACR */

      regval  = getreg32(STM32H5_RCC_PLL2FRACR);
      regval |= STM32H5_PLL2FRACR_PLL2FRACN;
      putreg32(regval, STM32H5_RCC_PLL2FRACR);

      /* Enable PLL2 */

      regval  = getreg32(STM32H5_RCC_CR);
      regval |= RCC_CR_PLL2ON;
      putreg32(regval, STM32H5_RCC_CR);

      /* Wait until PLL2 is ready */

      while ((getreg32(STM32H5_RCC_CR) & RCC_CR_PLL2RDY) == 0)
        {
        }

      /* Configure PLL3 */

      /* PLL3CFGR */

      regval  = getreg32(STM32H5_RCC_PLL3CFGR);
      
      /* Set the PLL3 source and main divider */

#ifdef STM32H5_PLL3SRC_HSI
      regval |= RCC_PLL3CFGR_PLL3SRC_HSI;
#elif defined(STM32H5_PLL3SRC_CSI)
      regval |= RCC_PLL3CFGR_PLL3SRC_CSI;
#elif defined(STM32H5_PLL3SRC_HSE)
      regval |= RCC_PLL3CFGR_PLL3SRC_HSE;
#elif defined(STM32H5_BOARD_USEHSI)
      regval |= RCC_PLL3CFGR_PLL3SRC_HSI;
#elif defined(STM32H5_BOARD_USECSI)
      regval |= RCC_PLL3CFGR_PLL3SRC_CSI;
#else /* if STM32H5_BOARD_USEHSE */
      regval |= RCC_PLL3CFGR_PLL3SRC_HSE;
#endif
     
      /* Set RGE, FRACEN, VCOSEL, and M from board.h */

      regval |= (STM32H5_PLL3CFGR_PLL3RGE | STM32H5_PLL3CFGR_PLL3FRACEN | 
		 STM32H5_PLL3CFGR_PLL3VCOSEL | STM32H5_PLL3CFGR_PLL3M);

#ifdef STM32H5_PLL3CFG_PLL3P_ENABLED
      regval |= RCC_PLL3CFGR_PLL3PEN;
#endif
#ifdef STM32H5_PLL3CFG_PLL3Q_ENABLED
      regval |= RCC_PLL3CFGR_PLL3QEN;
#endif
#ifdef STM32H5_PLL3CFG_PLL3R_ENABLED
      regval |= RCC_PLL3CFGR_PLL3REN;
#endif
      
      putreg32(regval, STM32H5_RCC_PLL3CFGR);

      /* PLL3DIVR and PLL3FRACR */
      
      /* Get settings from board.h */
     
      /* PLL3DIVR */

      regval  = getreg32(STM32H5_RCC_PLL3DIVR);
      regval = (STM32H5_PLL3DIVR_PLL3N | STM32H5_PLL3DIVR_PLL3P | 
		STM32H5_PLL3DIVR_PLL3Q | STM32H5_PLL3DIVR_PLL3R);
      putreg32(regval, STM32H5_RCC_PLL3DIVR);
      
      /* PLL3FRACR */

      regval  = getreg32(STM32H5_RCC_PLL3FRACR);
      regval |= STM32H5_PLL3FRACR_PLL3FRACN;
      putreg32(regval, STM32H5_RCC_PLL3FRACR);

      /* Enable PLL3 */

      regval  = getreg32(STM32H5_RCC_CR);
      regval |= RCC_CR_PLL3ON;
      putreg32(regval, STM32H5_RCC_CR);

      /* Wait until PLL3 is ready */

      while ((getreg32(STM32H5_RCC_CR) & RCC_CR_PLL3RDY) == 0)
        {
        }

      /* 250 MHz SYSCLK. VOS0 = 1.30V to 1.40V
       * Enable FLASH 5 wait states 
       * See Table 44. in Reference Manual
       */

      regval = FLASH_ACR_LATENCY_5;
      putreg32(regval, STM32H5_FLASH_ACR);

      /* Select the main PLL as system clock source */

      regval  = getreg32(STM32H5_RCC_CFGR1);
      regval &= ~RCC_CFGR1_SW_MASK;
      regval |= RCC_CFGR1_SW_PLL;
      putreg32(regval, STM32H5_RCC_CFGR1);

      /* Wait until the PLL source is used as the system clock source */

      while ((getreg32(STM32H5_RCC_CFGR1) & RCC_CFGR1_SWS_MASK) !=
             RCC_CFGR1_SWS_PLL)
        {
        }

#if defined(CONFIG_STM32H5_IWDG) || defined(CONFIG_STM32H5_RTC_LSICLOCK) || \
    defined(STM32H5_USE_LSCO_LSI)

      /* Low speed internal clock source LSI */

      stm32h5_rcc_enablelsi();
#endif

#if defined(STM32H5_USE_LSE) || defined(STM32H5_USE_LSCO_LSE)
      /* Low speed external clock source LSE */

      stm32h5_rcc_enablelse();
#else
      /*
       * There is another case where the LSE needs to
       * be enabled: if the MCO1 pin selects LSE as source.
       * Other cases can be handled by peripheral drivers.
       */

       if ((getreg32(STM32_RCC_CFGR1) & RCC_CFGR1_MCO1SEL_MASK) == 
            RCC_CFGR1_MCO1SEL_LSE)
         {
           stm32h5_rcc_enablelse();
         }
 
#endif /* STM32H5_USE_LSE */
    }
}
#endif
